{"archived":false,"author":"throwaway66667843","author_flair_css_class":"purple","author_flair_text":"5'2 | 91.6lbs | BMI 16.75 | 20F","brand_safe":false,"contest_mode":false,"created_utc":1504224181,"distinguished":null,"domain":"self.proED","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavjb","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"rantrave","link_flair_text":"Rant/Rave","locked":false,"media":null,"media_embed":{},"num_comments":2,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"no_ads","permalink":"/r/proED/comments/6xavjb/i_spiraled_so_quickly/","pinned":false,"retrieved_on":1507285936,"score":29,"secure_media":null,"secure_media_embed":{},"selftext":"I've been restricting to anywhere from 200 cals to 700 cals a day for the past week and a half. Before that, I was under 1200 every day. If anyone offers me food, I turn it down.\n\nI thought I had control over this, but I don't. I've never restricted this intensely without having a binge day or without bingeing in general. I dropped weight in the past month that I never thought I'd lose again. I'm at college so I don't have a scale, but I think I'm somewhere around 95/96 lbs now.\n\nI don't necessarily want to be relapsing, but it's not even my choice. I feel like I have to. Other times, I've just wanted to, but now it's not a decision. I just can't eat. If I do eat, it's a failure.\n\nMy boyfriend wants me to see a doctor and I think I should too because I feel as if I'm on the edge of fainting all of the time. I can't cross my legs for too long because they get pins and needles.\n\nI'm so sick of having an eating disorder but I also feel like I don't want to get better yet. I feel like I have to get sicker because otherwise all of this would've been for nothing anyways.\n\nIdk, just needed to vent somewhere. If you got this far, thanks for reading.","spoiler":false,"stickied":false,"subreddit":"proED","subreddit_id":"t5_38934","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"I spiraled so quickly.","url":"https://www.reddit.com/r/proED/comments/6xavjb/i_spiraled_so_quickly/","whitelist_status":"no_ads"}
