{"archived":false,"author":"Pxrkers","author_flair_css_class":null,"author_flair_text":null,"brand_safe":false,"contest_mode":false,"created_utc":1504224051,"distinguished":null,"domain":"self.RealHCF","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav4l","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":null,"permalink":"/r/RealHCF/comments/6xav4l/pxrkers_staff_application/","pinned":false,"retrieved_on":1507285927,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"Name, and IGN? \nMy name in real life is Parker, but my ign is Pxrkers.\n\nCountry and Timezone? \nI live in the United States, and my timezone is CST or Central standard timezone.\n\nActivity (How much time can you put in?): \nI can play around 6-8 hours a day!\n\nDo you need help SSing? How good are you? \nNo, I do not need help when I am SSing. I would like to consider my self a decent screensharer. The only thing I cannot find is Demon which I've heard is easy to find but I've not looking into it that much.\n\nWhy do you want to be staff on our server? \nI would like to be staff on RealHCF for multiple reasons. The first reason I want to be staff is because I want to help out the community to the best of my ability. The second reason I want to be staff on RealHCF is so that I can help out the other staff members.. such as with ssing, what I think should happen in a certain situation, etc. The final reason I am going to be listing is so that I can help grow the server, If you do not know I am a youtuber and my best videos are my staff series. I have been hoping to get a good server to do a staff series on again. I know this portion doesn't have much infomation, I accidentally combinded both this portion and \"Why should we pick you to be staff on RealHCF\" portion because I didn't see this portion until after I made the \"Why should we pick you to be staff on RealHCF\"\n\nHow are you better than the other applicants?\nI believe that I can bring loads of talents to the server. If I see someone that needs help, I will immediately go to do that if I am not already preoccupied with another player. I'm good at just offering basic support or answering questions, and I will ask the help of a higher-up staff if I am unsure of myself with anything to do with the server (as I'm new to it, since it is just now revamping). Although I'm able to make up for it with my screen sharing, and better judgment to decide whether a player I am watching is hacking or not, I've rarely falsely banned anyone in the past, and I would strive to make sure everyone I ban is hacking. Another reason I am applying on RealHCF is that I want to make an impact on the community. If I am given a staff rank I am going to try to strive to make the experience of every single one of the players better. One way I am able to do that is by helping in TeamSpeak almost all of the time I am on the server. Another way I can do that is by helping in game. I am looking to help the server grow and develop, also not only helping the server grow and develop but by the server also helping me grow and develop as a staff member. I have been playing HCF since before it was popular. I have been in the community for about 2 1/2 to 3 years. With that said I can honestly say that I have seen good and bad staff and what not to do when I am staff. I have also been mentored by a couple of actual good staff that use to be on Arson. Both of the notable staff members names is Emotionill and Shaaf, Emotionill was a great help in both me becoming a better staff member and also a better person. Shaaf was also a big help in me becoming a better staff member, not so much a better person.I believe that my willingness to help is what really sets me away from most of the other applicants. I am very vocal and if needed I can step up to the plate and help lead to the best of my abilities. Being that if I do get accepted I will be placed as a trial-moderator I will not be able to do much then but if I am fortunate enough to move up the ranking system I would be more than happy to prove and show off my leadership skill/talent. I believe that the experiences that I have had being staff helped me become a better staff member. The experiences I have had helped me learn a lot of things. One of the main things I have learned throughout my time being staff in the HCF community is screen sharing. Screensharing I believe is the most crucial part of being a staff member, because if you do not know much about screen sharing then you more than likely will not be able to find ghost clients such as Vape, etc. Confidence is a big talent/skill is confidence. If your confidence in a server or just your confidence in your ability to moderate and fulfill your ranks duties is low you will probably not be the best staff member. It may also lead to abusing your powers or being inactive. Speaking of that, I would like to believe that I have a high confidence in both the server and my moderation skills.Another talent of mine is my respectfulness. In my eyes, I believe that I am very respectful to both players and staff members. I do not create grudges against players or staff members. I also respect both players and staff members ideas and concerns.In my opinion, I am a very chill person. I do not get mad or frustrated easy. When someone that is frustrated comes in TeamSpeak looking for help, I keep calm and try to help to the best of my abilities. If I can not help the player I will try to get a staff member that has the permissions and is able to help! I have a really respected value which is patience, patience is very important in being a great staff member. Patience is needed in certain situations or scenarios. For example, if a player is misunderstanding what you are saying, I try to help and not give up at least until the player understands. Even if I have to go more and more in-depth until he understands. One of my main skills that I can bring to the server is my maturity. I believe that I have developed a good maturity over my almost 16 years of living. I am not toxic in chat or TeamSpeak, and I believe that person's maturity is one of the biggest factors for a staff member. I do not make harmful jokes to any players or staff members. Sometimes I like to play a joke, however, I do think about the joke before I do it, therefore it will not be harmful to the server.\n\nDoes anyone else have access to your Mineman account? Could or would they possibly leak the information for pay? Would you?:\n No, no one else has access to my account.\n\nDo you have skype? (Only put it here if you're accepted, but at least tell us yes or no.) \nYes, I do have skype but I prefer skype or discord.\n\nDo you have teamspeak and discord? Both are REQUIRED. \nYes, I have both teamspeak and discord.\n\nHow old are you?\nI am currently 15 years old, but I will be turning 16 in december\n\nAnything we should know? \nWell, Hi my name is Parker. As you can tell from my application I am 15 years of age. I am also a youtube rank on the network currently, and I am looking to take my talents to a server and help them out by staffing and recording staff series.","spoiler":false,"stickied":false,"subreddit":"RealHCF","subreddit_id":"t5_3ni0m","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Pxrker's Staff Application","url":"https://www.reddit.com/r/RealHCF/comments/6xav4l/pxrkers_staff_application/","whitelist_status":null}
