{"archived":false,"author":"rkona2018","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224244,"distinguished":null,"domain":"self.cordcutters","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavqm","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":16,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/cordcutters/comments/6xavqm/what_outdoor_antenna_should_i_get/","pinned":false,"retrieved_on":1507285939,"score":3,"secure_media":null,"secure_media_embed":{},"selftext":"TVFool Report- http://www.tvfool.com/?option=com_wrapper&amp;Itemid=29&amp;q=id%3de6a49fde4f6e61\n\nI live about 25 miles away from Detroit and 30 miles away from Toledo. My Winegard Flat Indoor Amped isn't working too well these days, so I'm getting an outdoor antenna. I plan to mount it on my chimney with a 5 foot mast. I've been getting mixed messages from Amazon reviews and Web articles, so I decided to ask some internet \"experts\" on Reddit. My basic wishlist-\n\nDetroit Channels (PSIP Virtual #)\n2, 4, 7, 20, 38, 50, 56, 62\n\nToledo Channels (PSIP Virtual #)\n11, 13, 24, 30, 36\n\nCanada Channels (PSIP Virtual #)\n9, 32\n\nThe ones I seem to be having the hardest time with are WUPW 36 and WNWO 24 from Toledo, and WADL 38 and WMYD 20 from Detroit. I am most concerned about Multi/Omni/Uni directional. I can't use a unidirectional antenna because my signals come from two different directions. Multi Directional seemed promising but most say their reception pattern is around ~60 degrees (except for ChannelMaster ExtremeTenna which can pick up from 180 degree range). This leads me to believe I need an Omnidirectional.\n\nI initially thought about the Mohu Sky, but the people on reddit had some very bad things to say about it and its Amazon twin. Then I looked at the ChannelMaster Smartenna, but it only picks up Yellow and Green CEA color codes. Now I'm stuck looking at Terk and RCA omnis but they don't seem much more powerful than the antenna I have now, only outside. \n\nSo, I'm looking for anyone who can tell me what antenna I should get. If one of the antennas I mentioned was good, if there's another omnidirectional antenna you can recommend, or if there's a multi directional antenna that I can pick up channels from both sides. Thanks in advance.\n","spoiler":false,"stickied":false,"subreddit":"cordcutters","subreddit_id":"t5_2sa6y","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"What Outdoor Antenna should I get?","url":"https://www.reddit.com/r/cordcutters/comments/6xavqm/what_outdoor_antenna_should_i_get/","whitelist_status":"all_ads"}
