{"archived":false,"author":"BronzeAzirHere","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224006,"distinguished":null,"domain":"self.forhonor","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xauyk","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/forhonor/comments/6xauyk/a_new_players_thanks/","pinned":false,"retrieved_on":1507285925,"score":4,"secure_media":null,"secure_media_embed":{},"selftext":"[For Honor, as seen through the eyes of a Freeweekender, then buyer, now still refusing to give up]\n\nSo now that I can solidly say that For Honor has permanently entered my game rotation, I hear a lot of people ask me how I'm experiencing being thrown into the shark infested waters not even covered in chum, but rather as the chum. I wanted to go over and share with everybody who has helped me out how For Honor has been for me. \n\nNumber 1, I call bullshit. Not on Centurion, not on Gladiator, not even on the server disconnects. I call bullshit on everyone who told me the community is toxic, the game is trash, and that it's a waste of money. Just about half the time I get my faced brutally stomped in by some Rep 96 vet, they offer me help and are willing to go the extra mile for me. I'll be honest, I can't CGB almost at all, and I'm learning to parry fairly quickly. Having a vet help me out and either teach me one of the rules, like dodging and being guard broken can't CGB, to show me how to deal with Shinobis ranged attacks has helped me tremendously. \n\nNumber 2, I can keep myself off tilt. This game can be downright hilarious sometimes. I can't help but laugh whenever I think of the thoughts going threw a heroes head during my execution. \n\"God he is heavy for a skinny dude.\"\n\"How do my teeth look?\"\n\"I almost feel sorry. Almost\" \nAt least I can say that the game can be lent towards humor. Especially Shugoki. Just everything about him. \n\nNumber 3, Learning the basics of a character isn't a tremendously straining process. I have a simple regimen. Try in practice tool, fight some level 2 bots, then into dominion. Play till Rep one and repeat. So far I have Rep 1 Kensei, Zerker, and Lawbro in that Order, with Shugoki and Cent on the way. (I play Shugoki for Heavy orders)\n(And I'm not going to continue playing Cent after Rep 1. I want variety, not INCREDIBILLUS!)\n\nThe Customization is pretty deep and I enjoy it. My Characters look suitably sick with Rep 1 gear, and I can't wait for better and cooler gear. \n\nAll in all, I wanted to end this by saying thank you for all those who helped me and will help me in the future, as well as to ask a simple question.  Who do I need to level next? And why? Whether it's coming from a main or not, I wanted to hear the best argument for a hero. Not just as meta decrees, but also memes, jokes, taunts, and a burning passion for your hero. So far I have never played\nConquerer( RAH RAH)\nPeacekeeper(Ill cut you bitch)\nValkyrie( God I love they kept the mythos and is only female)\nShinobi( I... I.... just fuck you.)\n\nAnd what Characters should I take a second chance on\nWarden(God using sword handles is just mainstream)\nWarlord(The beard is mightier than these sword and pen)\nOrochi( I would insert autistic screaming joke but I'm to lazy. Wait shit no)\n\n","spoiler":false,"stickied":false,"subreddit":"forhonor","subreddit_id":"t5_38p4n","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"A new players thanks.","url":"https://www.reddit.com/r/forhonor/comments/6xauyk/a_new_players_thanks/","whitelist_status":"all_ads"}
