{"archived":false,"author":"PeakCell_CR","author_flair_css_class":"Bandit","author_flair_text":"Bandit","brand_safe":true,"contest_mode":false,"created_utc":1504224159,"distinguished":null,"domain":"self.ClashRoyale","edited":1504558802.0,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavgb","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"","link_flair_text":"Strategy","locked":false,"media":null,"media_embed":{},"num_comments":79,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/ClashRoyale/comments/6xavgb/strategy_climb_the_ladder_easily_guide_to/","pinned":false,"post_hint":"self","preview":{"enabled":false,"images":[{"id":"EWm97w0xeXhW5vJANys3aKBTRe4tkt35DvBUe-Pqg2Q","resolutions":[{"height":68,"url":"https://i.redditmedia.com/YuTttIguXK0kl2JZxhfT1EJKa1xsERPAYRmyxr6NYDg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=32c7c5f9d5c17b3711bd3347c35653a6","width":108},{"height":136,"url":"https://i.redditmedia.com/YuTttIguXK0kl2JZxhfT1EJKa1xsERPAYRmyxr6NYDg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=0168d2a3ffcdb75084000a87833c0282","width":216},{"height":202,"url":"https://i.redditmedia.com/YuTttIguXK0kl2JZxhfT1EJKa1xsERPAYRmyxr6NYDg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=006a4138e88c8ccfe87f3cbd6226c51f","width":320},{"height":404,"url":"https://i.redditmedia.com/YuTttIguXK0kl2JZxhfT1EJKa1xsERPAYRmyxr6NYDg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=e95fda63059be231a96ebf7ab304c5e4","width":640},{"height":606,"url":"https://i.redditmedia.com/YuTttIguXK0kl2JZxhfT1EJKa1xsERPAYRmyxr6NYDg.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=f6995df92b41587f3969c7bc8635f46e","width":960}],"source":{"height":621,"url":"https://i.redditmedia.com/YuTttIguXK0kl2JZxhfT1EJKa1xsERPAYRmyxr6NYDg.jpg?s=1435fecd7eafec31bb49781acee426e9","width":983},"variants":{}}]},"retrieved_on":1507285934,"score":120,"secure_media":null,"secure_media_embed":{},"selftext":"**Hello Reddit.** Time to write a guide again.\n\nNow I want to talk about a pretty **personnal strategy** I've used some time ago (~7 months ago) which could help many people climb the ladder **easily**. This strategy is no use for tournament play tho. For ladder play, it may be enough for people to climb pretty high while learning without reading any other guide.\n\nAlso don't forget this important thing : **The goal is to climb by feeling you are a better player, which will be achieved by mastering a deck that is unique to you.**\n\n---\n\n**BackGround**\n\n---\n\n**Times ago I was stuck at a really low level**, speaking about trophy range. I was stuck at ~2300; then got some cards and climbed with those, **using two strategies I'm going to talk about**. At the time **I wasn't reading guides** so you can believe me when I tell you these strategies are pretty good. I climbed my way up from **2300 to 3000**, and later from **3400 to 4700** using these tactics. This last climbing was done with **low level cards 7 months ago**, and I was matched against **lvl 12 almost-maxed** players all the time; which should be a great argument to talk about how these strategies helped me. I will talk about what I did on this last session (3400-&gt;4700) tho since my knowledge was way better at the time.\n\n**My first strategy** consists on an **action plan to get used to your deck**. This is how I learnt without having to read guides, and is also the reason why I can now write some by myself. However keep in mind that **this strategy won't teach you all the game**; it will only teach you how to **master one deck**. The mastery level you can acquire is pretty huge, the deck I was using to climb up to 4700 was defined by many as a non-meta and a bad deck. **Take my word, you will climb by playing a mastered bad decks against non-mastered good decks**. - PeakCell 2017. This strategy works better with **Miner/Hog cycle/Bridge spam decks since the more diverse your gameplay CAN BE, the higher will be the strength of your deck once mastered**. Mine is a hog cycle, and I'm still playing it.\n\n**My second strategy** needs the first to already be applied. Remember my philosophical statement earlier ? **If you mastered your deck 100%, what would you think of your opponent's mastery level on their decks ?** Right, you'd think you are better on yours. Which also means one thing : you **know** you **will** beat them. And the simple fact of knowing that will greatly help you win against them. But, as I said, for it to work you really need to master your deck.\n\n---\n\n**Deck Assimilation Strategy**\n\n---\n\nThis strategy is really the one **you'll need to work around the most**. You know, in Clash Royale, you have what we can call the **conscious learning** and the **unconscious learning**. Here, we want to step away from the latter and work while using the former : What you need is to **be conscious of what you learn**, because you'll learn it **faster** this way. Your opponents, for most of them, **won't do that** and will learn unconsciously, meaning they will **learn slower but passively**.\n\n**Conscious learning can be a lot of things** : Here, while reading me, you're doing conscious learning. While reading guides, you learn actively; that's what makes you improve : Learn actively, whether you read guides or not. \n\nMost people in Clash Royale do **the opposite** : They play casually, and don't read guides nor try to assimilate their decks well. They sometimes don't want to because it's better for them not to think about it, or they just don't even know they can.\n\nHere I'll give you an **action plan** which is extremely similar to the one I used to climb my way up. I hope it will have the same effect with you, but don't forget to read the next part too because it is **really** important as well.\n\n- First, you need to **know the meta**, or try to think about **what it will become** : Know the most used cards, because you'll need to play against them.\n\n- Make **your own** deck ! DON'T try to make a deck full of meta cards. Make a deck that you **LIKE TO PLAY**. You can use underpowered and off-meta cards. Remember ? **A mastered off-meta deck will most likely beat a meta deck which is not well played**.\n\n- **Your deck is ready**. You like to play the cards you put inside, and you're ready to go. **Slow down** mate ! Next step is to try it **against friends**. Try to find friends who know the game well, and who know the meta as much as you. Battle them with **your deck**, and discuss with them : **What could you improve** ? After many battles, many tests, you will have a deck which **fits you well and which has answers to many situations**. Try to finish this step with a **versatile deck**, so you will have **a lot of different ways to play it** !\n\n- NOW you can go play your deck in **ladder mode**. Now that you can do that, you'll be able to play **as many games as you want**. But, remember ? **Active** learning. When you will play ladder you will find a lot of **different situations and decks**, you will need to establish which decks counter you, which decks you **have trouble** playing against.\n\n- Now, **you know what are your problems** ! The decks that make you losing, the decks that are the \"door keepers\" to your next arena, or even to the top tier of Clash Royale players. You know what ? **That's perfect** ! Because these decks are not mastered in most of the cases (And here the word \"most\" means a huge majority) and as long as your deck has a nice versatility, it can potentially be played another way. \n\n- **Invent new gameplays to counter your non-mastered counters**. It may not be easy but I'm here to help you my mate, don't worry. Do you know all **the counterplay available in clash royale** ? If not, you should check other guides about it, but I'll list some of them for you : Outcycling your counters, split pushing, changing the focus with a zap, killing with spells, tanking hits instead of defending to reduce your ennemy's lead, judge your ennemy's expenses to know when to punish them, attack on an unspected lane, start a push while defending...\n**Try new gameplays** with your deck, and try all the things you can to counter your counters.\n\n- **After a while of testing and inventing**, after tons of defeats, after tons of wins, you'll **know how to play against your counters**. You'll know how to play against anything. Even your hardest counters won't be enough to defeat you until a certain range of trophies. Even maxed cards won't be a problem for you ! You won't even care about your opponent's card levels. \n\n*Things to consider while following these steps :*\n\n*1) Don't change. Play the same deck over and over, the goal is to master it.*\n\n*2) You have to think about what made you lose, every game.*\n\n*3) Following the second point, think about how you could win. In the lost game, when would an other choice have been better for you ?*\n\n*4) Only play a deck which is fun to you. If you get bored of it the tactic will be destroyed.*\n\n*5) ALWAYS think about improving.*\n\n---\n\n**The \"Number One Mood\"**\n\n---\n\nThis part is **really important**, but is **not something to work, just something to know**.\n\nNow, **you have your deck**. You know all the background of your deck : You tried all the synergies, you tried all the counterplays, you faced many obstacles, you know your deck and you like to play it. \n\nNow, **WHO are you fighting against** ? I'm not talking about your current game. I'm talking **generally**. Who are the players you fight against ? **Do you feel they play good** ? **Do they play better than you** ? \n\nIf you followed the last part of this guide, you probably know they are all **lacking some level of mastery**. You're more likely to see their errors, as well as yours. AND knowing that they are not better with their decks than you are with yours is actually by itself a **good way to win** ! \n\nNow, you're **not a fair opponent to fight against for most of the people you meet** : You **know what you** do way **better** than they know what they do. They have the advantage of the card levels **sometimes**, but that's something you will generally be able to **shut down by being better**. \n\nKnowing that you play your deck better, in fact, will help you be **more confident about your skill**, your chances of winning, and be less stressed out by superior levels or cards that are cancer to you.\n\nThis is a pure psychological tip : Knowing that will simply make you **better at winning**. Just forget the commercial part : Play to win players ? **They don't exist**. Higher leveled players ? **Neither**. Counter decks ? **Skilled matchups**. **The most skilled of the two always wins, and the most skilled of the two, it's you**.\n\nSo just be aware : If you know your deck well, if you play it since a long time and know all the synergies, tried a lot of things : **You will win most of your games** against higher-leveled people who didn't do the same with their decks.\n\nYou may tell me \"But, Peak, in the last part you don't give any tips\" -&gt; **Because I don't have to** ! I just had, in this part, to **tell you** that if you followed the last one you're a **king of the ladder mode**. Now that you know that, just go and climb all the way to the top with your new favorite deck you've became friends with.\n\nI also have the feeling that I'm repeating myself a lot in this part so let's just move on to the next part.\n\n---\n\n**Pros&amp;Cons of this method**\n\n---\n\nThis method seems **quite easy**, and maybe **not that efficient**. But some points are to **clarify** :\n\n**Pros**\n\n- The deck you are learning is **unique to you**, which makes it **less comparable to others**. This way, **feeling you're the best with it will be easier** than if you played a meta deck.\n\n- Because of the fact that this deck is **YOUR** deck, your opponents **won't know how to counter it right away**. If you attain a **great level of mastery**, a lot of your opponents might **not even** find out a **single** way to counter it.\n\n- You will probably **like the game better**. That's psychological and linked to the second part of the guide which should come naturally.\n\n- You will be able to **judge other people's gameplays and find the mistakes** in them way easier. \n\n- You'll learn **how to self-improve**.\n\n- People who are **sceptical about the honesty of the matchmaking** will **LOVE** this technique : By just being better you just almost **never care about being countered or not**.\n\n- Much more could be said but these are the main pros.\n\n\n**Cons**\n\n- Well, this just **doesn't work for tournaments**. Your deck will still be great in ladder mode but could be really bad in challenges; Also, you'll only be a beast on one deck. The only good thing it helps for in tournament play is to be able to **learn tournament decks faster**.\n\n- Depending on **your personnality**, you **might not be able** to exploit the \"number one mood\" strategy. If you can't, for example if you are the type of person to lack self-confidence too much, the **whole method could be way less efficient** on you.\n\n- I didn't talk about it, but **obviously your card levels still matter**. **They just matter less**.\n\n- It will **take you some time** to learn and master your deck, but you should have an **easier grasp on your favorite cards**.\n\n- Not **every** off-meta deck is gonna be **efficient**. You really need to work around the composition of your deck before going to the ladder mode.\n\n---\n\n**Conclusion**\n\n---\n\nHere I gave you the **specific strategies that worked for me**. Preparing a deck like this helped me **see people's errors**, including mine, and know that a **LOT** of people are not used to play their decks as I was. So I tried to reach ranks where people **would actually be pretty great with their decks**, and it made me go **pretty high**.\n\nI hope these specific things will help you; they helped me back then and I'm sure some people could make a lot out of this technique even if it can seem pretty vague.\n\n**Good luck and have fun** ! Also **don't forget to comment down below** if you have any question, I'll answer it as fast as I can :L\n\n**EDIT : This guide was shared with Clash Royale Arena. You can check the comments and read the guide there too !** \n[Link to CRA](https://clashroyalearena.com/guides/number-one-mood)","spoiler":false,"stickied":false,"subreddit":"ClashRoyale","subreddit_id":"t5_3bog8","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"[Strategy] Climb the ladder easily - Guide to conscious deck learning and the \"Number One Mood\" Psychological strategy","url":"https://www.reddit.com/r/ClashRoyale/comments/6xavgb/strategy_climb_the_ladder_easily_guide_to/","whitelist_status":"all_ads"}
