{"archived":false,"author":"Mace_ya_face","author_flair_css_class":"user nvidia","author_flair_text":"R7 1700 @ 3.8Ghz | GTX 1080 Ti | PG348Q","brand_safe":true,"contest_mode":false,"created_utc":1504224041,"distinguished":null,"domain":"self.nvidia","edited":1504358401.0,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav3d","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"psa","link_flair_text":"PSA","locked":false,"media":null,"media_embed":{},"num_comments":35,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/nvidia/comments/6xav3d/if_youre_experiencing_poor_performance_after_the/","pinned":false,"retrieved_on":1507285927,"score":10,"secure_media":null,"secure_media_embed":{},"selftext":"So, like many other i5 users, my BF1 performance was pretty poor, with my GTX1080Ti bottlenecked all the bloody way. After the game's latest patch though, a large number, but not all, i5 users have now found the game to be totally unplayable.\n\n\nIn a fit of rage induced by DICE screwing yet another game post launch with crappy support, I tried turning on DX12. *Jesus*. Frame-rates fired up. I went from, **and I swear this is true**, an average of 28FPS on Amien on DX11, to an average of 68FPS on DX12. Still a *huuuuge* drop from the 80+FPS I was getting pre-patch, but playable.\n\n\nOddly though, other maps saw an improvement beyond pre-update performance. That big map with the Fao Fortress bit was locking at my 95FPS cap, only dropping to the mid-70s when there were large explosions.\n\n\nOther friends/players using i5s and had this horrific performance also saw big improvements after turning on DX12, though all but one had to update to the latest drivers for it to work. I also have a few people rocking i7s, but it was hit and miss for them gaining. Though it should be said, those that did gain with i7s were **using Pascal GPUs**.\n\n\nSo, if your i5/i7 build was slammed by DICE being the lazy, couldn't care less devs they've turned into the past few years, here's the combo that both fixed the performance, and frame delivery:\n\n\n- Turn on DX12. Duhh.\n\n\n- Set your GPU to \"Prefer Maximum Performance\", to ensure it doesn't under-clock when the CPU is bogged-down.\n\n\n- Set the max pre-rendered frames to 1\n\n\n- If you have it, force G-Sync. Don't leave it on the \"Use Global Setting\"\n\n\n- Either force on or force off V-Sync in the control panel. Which ever you prefer in-game. Just don't use the in-game one. It's buffer pipeline is, to put it professionally, a pile of milky dog-shit\n\n\n- ***If your monitor has a refresh rate above 60Hz***, using either RivaTuner or the user.cfg trick (Google it), set an FPS cap to 5FPS below your refresh rate.\n\n\n- Set the game's priority to high. *Note;* this only benefits some maps in large game modes. Small maps and gamemodes see no gain, and it can bug single-player.\n\n\nEnd rant: Sorry for the bile, but having to constantly fix the first main-stream multiplayer FPS I actually liked since CoD 4 non-stop because the devs demonstrably don't care, and the \"hardcore fans\" blame Microsoft for the Creator's update, and calling people like me \"faggots\", **AND THEN WATCHING NVIDIA ACCIDENTLY DO THE WORK FOR THEM**, really drives me up the wall. Also the game has a shed load of gameplay bugs too so this guide is fucking useless.\n\n\n**EDIT:** I cannot make this clear enough can I? **FOR i5 AND i7 USERS SUFFERING *CONSTANT* PERFORMANCE ISSUES *AND* DEEPER DROPS IN CERTAIN AREAS. *NOT* USERS THAT HAVE STUTTER, OR AMD CPUs!**","spoiler":false,"stickied":false,"subreddit":"nvidia","subreddit_id":"t5_2rlgy","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"If you're experiencing poor performance after the latest BF1 update, update your drivers and turn on DX12. NVidia fixing DICE's game for them.","url":"https://www.reddit.com/r/nvidia/comments/6xav3d/if_youre_experiencing_poor_performance_after_the/","whitelist_status":"all_ads"}
