{"archived":false,"author":"Glitchkey","author_flair_css_class":"","author_flair_text":"AI","brand_safe":true,"contest_mode":false,"created_utc":1504224031,"distinguished":null,"domain":"self.HFY","edited":1504231717.0,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav2d","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"OC","link_flair_text":"OC","locked":false,"media":null,"media_embed":{},"num_comments":65,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/HFY/comments/6xav2d/oc_department_of_engineering_redundancy/","pinned":false,"retrieved_on":1507285926,"score":622,"secure_media":null,"secure_media_embed":{},"selftext":"I stared at the screen, checking and double checking the blueprint. It couldn't be right. There was just no way being that wasteful was reasonable. \"Hey, Jo’shlin, can you double check something for me?\"\n\nJo’shlin leaned back from the cubbyhole next to me, then came over and looked at my screen. \"What's up?\"\n\nI pointed at the blueprint I was examining. \"I feel like this is a trick question or something. I'm working on efficiency design and all that, and he gives me this...this garbage heap as a question?\"\n\nTaking a moment to peer at the blueprint, Jo’shlin shook his head. \"Not sure what you mean. There are a couple places I see where you might be able to improve efficiency, but nothing really wrong overall.\"\n\n\"Nothing...\" I sputtered. \"I could remove half the systems from this ship and it would work just fine!\"\n\nTurning to stare at me for a moment, Jo’shlin just shook his head and sat back down in his cubbyhole. \"You could if you want to get flunked and dropped from the engineering program.\"\n\n\"Flunked... How?\" I just shook my head and stared for a bit at the blueprint.\n\n\"Okay, okay. I get that the species that designed this ship is big on redundancies and redundancies for redundancies, but this is just ridiculous. They have entirely pointless backup systems.\"\n\nJo’shlin just continued typing away in his cubbyhole. \"You slept through half of that class again, didn't you?\"\n\nI yawned. \"Yeah, so?\"\n\nThe typing stopped. \"There are reasons you're required to take these cultural classes as an engineer. This is one of those.\"\n\n\"Mmrph. Sure it is. This still feels like a trick question. There's no way anyone could make use of manual control systems for projectile weapons. It's pointless.\"\n\n“No, it isn’t pointless. You know about specialized evolution. You’ve already had to engineer your way around a living space for a tetrapodal species the size of a classroom.”\n\nShrugging, I rotated the ship view to check the weapons systems again. “Doesn’t matter, everyone requires targeting systems to hit something with a projectile.”\n\nTyping started up again in the cubbyhole next to me. “Not humans. Trust me. They do it very well. Specialized neural pathways or something. There are even projectiles in a lot of their recreational activities.”\n\n“Sure, sure. And I bet they only sleep once a month, too.” If there was a bit of an edge to my voice, I didn’t care.\n\nA notification went off in the corner of my screen before Jo’shlin spoke again. \"Do yourself a favor. I just sent you some holovid links for human sports. Go watch those before you manage to flunk yourself.\"","spoiler":false,"stickied":false,"subreddit":"HFY","subreddit_id":"t5_2y95n","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"[OC] Department of Engineering Redundancy Department (In Engineering)","url":"https://www.reddit.com/r/HFY/comments/6xav2d/oc_department_of_engineering_redundancy/","whitelist_status":"all_ads"}
