{"archived":false,"author":"G-Man6442","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224185,"distinguished":null,"domain":"self.swrpg","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavju","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":2,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/swrpg/comments/6xavju/adventure_ideas_involving_bree_starlighter_and/","pinned":false,"retrieved_on":1507285936,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"Let me start by saying, during my second trip to Disneyland Star Tours was my favorite thing, (I even have a StarSpeeder 3000 toy) so I may have more then a little bit of a soft spot in my heart for things related to it (honestly, RX Pilot Droid is probably my favorite model and I'm glad they're still canon).\n\nAnyway, while I was reading up on Wookiepedia about Star Tours to try and decide a few more things about my character, I discovered an interesting character in Bree Starlighter, basically the PR spokeswoman for Star Tours.\n\nDon't worry, I don't plan on doing anything crazy if I ever get to playing a Star Wars RPG (like actually including Earth), but I do still feel that she could be an intresting character to involve in an adventure or two.\n\nBasically, she's a typical spokesperson, hyping up their product and making it seem a lot better then it actually is, but the part of her that interests me is more related to her opinions on the Empire, namely how great they are.\n\nNow, in and of itself not a big deal, but her actress made sure to involve a facial tick whenever talking about them, so clearly in character she knows something's wrong, the question then becomes whose pulling the strings, and what leverage do they have?\n\nI know the bottom answer for the strings is easy, but is it the Empire directly, or is it because they have their hands in the travel agency? And more importantly, how does she know things are wrong? And why keep this job?\n\nI think there's a lot of possibilities to work from for an interesting adventure or two, some simple espionage perhaps, or maybe a straight up extraction.\n\nNo matter what, I'd be willing to bet that an adventure involving her would end with the group stealing a StarSpeeder.\n\nBut my main point is, what would be a good hook for that adventure?","spoiler":false,"stickied":false,"subreddit":"swrpg","subreddit_id":"t5_2vzmi","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Adventure Ideas Involving Bree Starlighter and Star Tours","url":"https://www.reddit.com/r/swrpg/comments/6xavju/adventure_ideas_involving_bree_starlighter_and/","whitelist_status":"all_ads"}
