{"archived":false,"author":"getbuckets419","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224091,"distinguished":null,"domain":"self.gameofthrones","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav8z","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"s-none","link_flair_text":"No Spoilers","locked":false,"media":null,"media_embed":{},"num_comments":2,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/gameofthrones/comments/6xav8z/no_spoilers_so_i_have_decided_to_read_the_books/","pinned":false,"retrieved_on":1507285930,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"So I finally decided to read the books and man am I glad I have. I absolutely love this serious and have been obsessing over it: reading this sub, watching alt shift x, listening to podcast (shoutout Bald move and the Ringer), and rewatching the series several times.\n\nWith the season ending I was thinking about possibly starting to rewatch, but instead decided to finally start reading. I am not much of a reader and when I do I never read fiction. I always thought if I am going to read it might as well be beneficial to my business career, so I have read books of that kind.\n\nI started today and have read the first 18 chapters and am already in love. I have never read that much in one setting, since college (and that was because I had too). Having watched the show before helps me so much. Since I don't really read fiction often, having watched the show puts the descriptions of each character into perspective for me and makes it so easy. \n\nSo far the book matches season 1 very closely. It is like rewatching the serious but you get extra bonus scenes with a few extra characters and more descriptions of place/people, its incredible! \n\nOne of the main reasons I put off reading, beside the lack of interest in reading for fun , was that I didn't want to start these books like so many others with the thought that they may never come to a conclusion for George. That is something I still fear, but I have a ways to go and a lot more pages to read.\n\nReally hope Mr Martin does decide to finish this series, even though it will most certainly be after the show comes to a conclusion, there can still be an incredible amount of joy reading after watching!","spoiler":false,"stickied":false,"subreddit":"gameofthrones","subreddit_id":"t5_2rjz2","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"[No Spoilers] So I have decided to read the books","url":"https://www.reddit.com/r/gameofthrones/comments/6xav8z/no_spoilers_so_i_have_decided_to_read_the_books/","whitelist_status":"all_ads"}
