{"archived":false,"author":"CatheterC0wb0y","author_flair_css_class":null,"author_flair_text":null,"brand_safe":false,"contest_mode":false,"created_utc":1504224235,"distinguished":null,"domain":"self.iwatchedanoldmovie","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavpd","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"","link_flair_text":"'80s","locked":false,"media":null,"media_embed":{},"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":null,"permalink":"/r/iwatchedanoldmovie/comments/6xavpd/i_watched_killing_of_america/","pinned":false,"retrieved_on":1507285939,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"I'm not sure if documentaries count, if they don't I'll understand, but if they do....\n\n\nI just watched \"The Killing of America\" documentary, and I must say, that was an incredibly disturbing and fascinating movie. For those that don't know, the film was made back in the 1980s by documentarian Sheldon Ranan and Leonard Schrader and was labeled as so controversial that the movie was never given a wide release on any viewing format until late 2016. \n\nThe film is about the decline of \"peace\" in America and our insatiable appetite for violence. The movie brings up a lot of great, yet disturbing, examples of the upbringing of our violent nature while trying to pinpoint how it began (SPOILER. The narrator says that once leaders like JFK and MLK Jr were assassinated, it was as if the bomb went off). \n\nI must forewarn if you are interested in this, the movie is incredibly ultra-violent. The documentary doesn't let up on just how violent our country can be. And he lays out example after example. From \"small time\" crimes like when two robbers went to a convenience store and shot the clerks on duty, to big time stories like the shooting at the Dallas clock tower and the Jonestown massacre, the documentary does not let up from the opening images and it just keeps you floored from start to finish. If you have the stomach, I can't recommend this documentary enough about why our nation is \"transfixed\" by violence. ","spoiler":false,"stickied":false,"subreddit":"iwatchedanoldmovie","subreddit_id":"t5_3o2sn","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"I watched \"Killing of America\"","url":"https://www.reddit.com/r/iwatchedanoldmovie/comments/6xavpd/i_watched_killing_of_america/","whitelist_status":null}
