{"archived":false,"author":"whyareyoulikethis17","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224168,"distinguished":null,"domain":"self.JUSTNOMIL","edited":1504236301.0,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavhg","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":38,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/JUSTNOMIL/comments/6xavhg/tropical_storm_salty_margarita_an_overdue/","pinned":false,"retrieved_on":1507285935,"score":63,"secure_media":null,"secure_media_embed":{},"selftext":"Hello everyone, \n\nFirst off, I have been reading this sub-reddit for years. It has been a form of solace, reassurance, drama, lamas, justice boners and rage inducing dinosaur stomping around the house on your behalf. But more than anything, it has helped me immensely. Both by showing me that boundaries are healthy and normal, and that being treated like a smeared piece of crap clinging to my mil's dumpy shoes is not. Validation is a powerful thing. And while you know it or not, reading about your struggles- both emotional and physical has been healing in strange way that only shared experiences can be.\n\nA brief run-down of my history and situation. DH (who is actually Dear Fiance, but we have been together for almost a decade, own a car and a house together and are starting trying for spawn, so I am going to refer to him as DH for simplicity)  and I got engaged at the beginning of this year after eight years together. We have lived together for six years and knew a long time before getting engaged that we were lifers. This means I have known his parents - specifically MIL for just about the same period of time. In short, I have proven myself as someone that is in this relationship for the long haul and have no intentions of going anywhere. And this has been the reality for many years.\n\nThe reason I am breaking my self-imposed silence is because of what happened this past weekend. I got treated so awful at a 'faaaaaamily' dinner that I literally could not fume about it to myself any longer. And, perhaps more pointedly, I feel I am very close to being at a cross-roads with her. As I said to DH, there is no reason in the world that I should be treated like crap by your mother. Literally none. I am at my limit. I have my DH's support and he has been lovely, but it is not getting better. It is not going way, and after an evening spent getting a face-full of rude comments, passive aggression, BEC and more- it is looking more and more like a confrontation is coming down the tubes.\n\nI don't like confrontation.\n\nBut I also don't like being a doormat either.\n\nIt is a tough place to be in, honestly.\n\nBut something has to give.\n\nMy usual tactic is ignore, deflect, turn her comments back on her, not engage, you all know those feels. But more and more the anger is growing. It is so insane that someone can willingly treat someone this way that sometimes I nit-pit over my actions, wondering what I did in that moment to 'earn' that comment or that passive aggressive text. I think, oh god- did I accidentally offend her? I know the answer. But I still worry. I was brought up with the belief that you respect your elders no matter what- but as I grow older I realize there are people that do not deserve your respect. Respect is earned, politeness and respect are completely different animals.\n\nThis weekend was the worst it has been in a while and it felt like proof that things aren't getting better despite our boundaries, bribes of dessert, etc. I know that DH is sad about me not having a better relationship with his mom (he - now - notices and even calls out his mother on her behavior, but at the end of the day it is still his mother and as many of us do, he wishes things could be different. Hell, so do I. I know it's a bummer dealing with a spouse that literally dreads spending time with your parents. I know I would be crushed if that was the case with him and my own parents (whom are mostly JustYes and love him to pieces).\n\nI realize this is more or less and introduction to future posts, so thank you for reading. I really appreciate it and I am already glad I started putting some of my thoughts into words here.\n\nPS: I'm thinking about calling her 'Tropical Storm Salty Margarita' because, one- while she is not a hurricane (aka: not near as bad as some on this site) she is still a fucking a pain in my ass. And two, because it reminds me of the time she told me I was a raging alcoholic for enjoying a beer by myself in the evenings after work about five years ago. If this name is too similar to other existing ones, please let me know. \n\n- Another thing, MIL reddits. But I'm quite sure she only sticks to the front page. Mostly so she can get annoyed at it's contents and bitch for the rest of the day. I doubt she knows about this sub-reddit. Regardless, I have and will continue to fudge the pertinent details here and there for privacy's sake.","spoiler":false,"stickied":false,"subreddit":"JUSTNOMIL","subreddit_id":"t5_377ps","suggested_sort":"old","thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Tropical Storm Salty Margarita: an overdue introduction","url":"https://www.reddit.com/r/JUSTNOMIL/comments/6xavhg/tropical_storm_salty_margarita_an_overdue/","whitelist_status":"all_ads"}
