{"archived":false,"author":"dwyanewadelebron","author_flair_css_class":null,"author_flair_text":null,"brand_safe":false,"contest_mode":false,"created_utc":1504224146,"distinguished":null,"domain":"self.unpopularopinion","edited":1504224336.0,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavew","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":37,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"promo_specified","permalink":"/r/unpopularopinion/comments/6xavew/feminists_are_the_biggest_hypocrites_on_earth_and/","pinned":false,"retrieved_on":1507285934,"score":70,"secure_media":null,"secure_media_embed":{},"selftext":"I saw a post here referencing the Women's March, and it gave me a thought. Does anyone realize that one of the speakers was Donna Hylton, a woman who served a 25 year prison sentence for participating in the rape, torture, and murder of a 62 year old man? I thought this was a travesty, as she is obviously a piece of shit and that is not a crime that you can be \"rehabilitated\" for. To make matters worse, she considers herself a victim and does not even reference the crime she committed on her website or during her speech at the Women's march.\n\nI thought, maybe the organizers of the Women's March are awful but I imagine most feminists would denounce this. I saw a thread in r/askfeminists about this and wouldn't you know, many feminists there were going out of their way to defend Hylton and say that she may have been \"rehabilitated\".\n\nHere are some upvoted comments: This was at +20:\n\n&gt;I mean I just did a cursory googling now about this but I imagine it is because she served her sentence for the crimes she committed and is now an important figure in activism and social justice.\n\nThis was at +5:\n\n&gt;I had never heard of her before this thread, but form Google I can't find any evidence that she is still for murder and torture. Its not like she was speaking about how great it is to rape men. She is a ex-prisoner campaigning for prison rights for women. The world is full of men who are former prisoners who now do the same, including rapists and murderers, I'm not sure why feminism should be devoid of such people. This seems to be another case of holding women and feminism to a different standard and then denouncing the entire movement when that standard isn't met.\n\nThis was at +13:\n\n&gt;A \"true crimes\" nonfiction paperback and a psychologytoday.com article from 1995 (about an event that apparently happened in 1985) do not make very strong statements to the facts of the case. It is worth noting that the psych-today article states \"Donna Hylton has been in prison 10 years for her part in the brutal, spectacular murder, in which three men and four women tortured a Long Island real-estate broker and, once he was dead, shut him up in a footlocker to decompose.\" While the violence inflicted in the crime is very disturbing, it is not simply that Hylton is (as you baldly say) \"is a cold-blooded psychopath.\" It is, in my opinion, naked editorialization on the part of the OP, the psycho-today, and the \"true crime\" novelist to start heaping insights into Hylton's character in 1995 and 2017 based off the events of a very horrible crime of conspiracy 30+ years ago. Anyways, maybe you should look into what kind of person Hylton is today, and what she said at the Women's March, and not start denigrating her character for a crime she (did not commit alone) and that she served her punishment for.\n\nThese people make my blood boil. They go out of their ways to \"name and shame\" men accused of rape, even if there is no evidence that a rape took place. They try to ruin these men's lives, remember the guy who supposedly raped mattress girl at Columbia University? No remorse for that guy despite the fact that there was no evidence a rape took place, but this vile degenerate scum Donna Hylton is a strong rehabiliated womyn deserving of our respect. Not to mention all the bullshit about how men are evil for not dating fat women, or men/lesbians are evil for not dating trans women. I love how these feminists love to force people to date people they are not attracted to, and they defend rapists who are women, but men who are even accused of mansplaining are irredeemable scum.","spoiler":false,"stickied":false,"subreddit":"unpopularopinion","subreddit_id":"t5_2tk0s","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Feminists are the biggest hypocrites on earth and that is why so few like them","url":"https://www.reddit.com/r/unpopularopinion/comments/6xavew/feminists_are_the_biggest_hypocrites_on_earth_and/","whitelist_status":"promo_specified"}
