{"archived":false,"author":"ObamaDontCare0","author_flair_css_class":null,"author_flair_text":null,"brand_safe":false,"contest_mode":false,"created_utc":1504224081,"distinguished":null,"domain":"self.unpopularopinion","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav83","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":8,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"promo_specified","permalink":"/r/unpopularopinion/comments/6xav83/i_hate_arya_stark_and_think_she_is_a_detriment_to/","pinned":false,"retrieved_on":1507285929,"score":7,"secure_media":null,"secure_media_embed":{},"selftext":"Arya Stark, where to begin.\n\n*****HUGE SPOILERS FOR GOT SEASONS 1-7 BEWARE*****\n\nLets start with the making of modern Arya, as this is who I have a problem with. Young Arya is annoying, but so are many characters, so lets start in Braavos. \n\nBeing a book reader I really liked and was interested in Essos, but they butchered it horribly. The entire Braavos Arya storyline was so boring and drawn out, I almost wanted to skip it. The intial scenes were promising, the Titan and the house of black and white looked exactly as expected, which is of course really cool. After the intial scenes, it just devolved into the same pattern- Arya washing bodies, then Jaqen asking her who she is, him walking away expressionless, and then the Waif abusing her or telling her she will never become a faceless person. \n\nLater on it did admittably get mildly better- the Mummers interaction was cool. But then hit the chase scene- which it is not an unpopular opinion to say was one of the worst scene in all of Thrones. Between the Waif terminator running and Arya being okay after getting wounds even the thickest plot armor shouldn't protect, it was godawful. The interesting thing is this is the last time we actually get to see Maisie act- after this she becomes a relentless, emotionless robot that makes scenes awkward (the scene with Hot Pie was a perfect example of this)\n\nI understand they are trying to portray her as a cold blooded assassin, but they are also trying to make her Arya Stark of Winterfell at the same time, and it is not working. She is obviously proficient with her blade, but there really isn't any indictication that she could be good enough to stand up to someone as amazing as Brieanne of Tarth (this scene just kind of disminished her character aswell, which is sad as Brieanne is so awesome). \n\nNow even though I am a huge Littlefinger fan, I am not mad he died as we really don't have time for his games. But his death seemed cheap, and everyone could see it coming even though it really wasn't logical. Arya was actung so cold towards everyone in Winterfell (the dialogue was horrible between Sansa and Arya) even in private, to all the sudden have a secret plan with Sansa and have what felt like a forced \"girls rule!\" moment wasn't consistant with the new Arya at all. \n\nI mentioned how we don't have time for LF's games, but we also don't have time for a passive aggressive riddle speaking assassin who doesn't really fit a true assassin role or that of a Stark. People are wondering how she will react to Jon Snow coming home, and if her character stays consistant (who knows if it will) it will likely be another strange dialogue like she had with Sansa since she really isn't a Stark anymore. Also her approval of Daenarys will likely be some big thing, which I don't think anyone could care less about. \n\nIn summary: She needs to die soon, she has no place in the end game of this series. Her plot armor is unbelievable as she has so much time sunk into her awful and boring storyline, and her forced smirks and dialogue is wasting time.","spoiler":false,"stickied":false,"subreddit":"unpopularopinion","subreddit_id":"t5_2tk0s","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"I hate Arya Stark, and think she is a detriment to the entire story.","url":"https://www.reddit.com/r/unpopularopinion/comments/6xav83/i_hate_arya_stark_and_think_she_is_a_detriment_to/","whitelist_status":"promo_specified"}
