{"archived":false,"author":"DanTheFireman","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224068,"distinguished":null,"domain":"self.buildapc","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav6g","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"discussion","link_flair_text":"Discussion","locked":false,"media":null,"media_embed":{},"num_comments":0,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/buildapc/comments/6xav6g/im_a_dumb_dumb/","pinned":false,"retrieved_on":1507285929,"score":1,"secure_media":null,"secure_media_embed":{},"selftext":"I feel like I might be being hard on myself but I just built my first PC yesterday. I previously bought it from someone who builds PC'd, but then upgraded my case and powersupply for future upgrades. I installed everything and got it all good to go before installing the GPU. Plugged in, lights turned on, fans spun. Good to go. I proceeded with GPU install and cable management (I'll note here at that I noticed the power cable for the GPU was a little hard to plug in, I had to add a little more force than I thought should be nessicary). I got to plug it in once I'm done, no lights except the GPU, and no fans spinning. Unplug power from the GPU, lights and fans once again. Really weird right? I thought I fried my motherboard somehow. The RAM, CPU, and cooler never got removed. I thought \"how the fuck did I mess this up?\". I looked at the old itx case I had it in and saw a cable that I knew was connected before I transfered all the parts. The 4x4 12v plug for the CPU. I couldn't find one with my power supply. I was so confused. I had 2 6x2 PCI supply cables but no 4x4. Then I clicked, I was plugging the 4x4 into the GPU thinking it was the PCI cable because they looked so similar. Added the right cable for the GPU, plugged the CPU in and wallah! I got boot. Works just fine. A small fuck up that took me several hours to figure out. I hope you all can laugh at me as I've laughed at myself and maybe save another newby from making the same mistake.","spoiler":false,"stickied":false,"subreddit":"buildapc","subreddit_id":"t5_2rnve","suggested_sort":"confidence","thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"I'm a dumb dumb...","url":"https://www.reddit.com/r/buildapc/comments/6xav6g/im_a_dumb_dumb/","whitelist_status":"all_ads"}
