{"archived":false,"author":"Mishka1988","author_flair_css_class":null,"author_flair_text":null,"brand_safe":false,"contest_mode":false,"created_utc":1504224017,"distinguished":null,"domain":"self.immigration","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav0f","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":10,"num_crossposts":0,"over_18":false,"parent_whitelist_status":null,"permalink":"/r/immigration/comments/6xav0f/adjustment_of_status_i751_completely_lost_and_not/","pinned":false,"retrieved_on":1507285926,"score":0,"secure_media":null,"secure_media_embed":{},"selftext":"Hello everyone, \n\nI am a bit overwhelmed today, so I would really appreciate any input I can get. I will try to keep this as short as possible.\n\nI am 28 and I have been living in the US for 11 years since September 2006. Originally, I came here as an international student. I attended a private Art High School, but after the graduation, I moved to NYC to attend college. Basically, I had been living in America on an F-1 visa for almost 8 years until September 2014. \nI met my wife back in 2007 during the summer art program that she was attending in my school (She is a US Citizen). We were too young at the time, but we clicked like crazy. Later on, after the program was over, we continued to stay in touch and decided that we wanted to be in a distance relationship that lasted for almost 2 years, until I permanently moved to NYC to attend college and be with her. We had separate addresses for a while until she graduated college and we moved in together in September 2012. We got married in mid-2013. I made a major mistake of not immediately applying for adjustment of status, instead, I waited a while, until June 2014 to send out my application for residency. We had an interview with USCIS officer in August of that year. Everything went great except the fact that the officer was confused that we kept separate bank accounts, and had the majority of our bills in my name. I received my temporary resident card in September 2014. \nLife in NYC has been nothing but a nightmare for me since then. My wife and I struggled through financial problems for while, and she decided to leave me in September 2015. I was absolutely heart broken, and couldn't understand anything that was happening. She kept insisting that we needed a break and that she needed to be on her own for a while. After she moved out and our lease ended, I had to find a small room where I stayed for a while until mid-2016. As we have been physically living separetely, we still maintained our relationship on friendly terms and we still, to this day, don't know whether we want to get divorced or not. When it was time to send out my \"Adjustment of Status\" application in, we were still living separately, but not desiring to get a divorce or go through any additional separation procedures, so I might have accidentaly stated that we were still living together in hopes that it would materialize.\nToday I received a notice from USCIS, in which they are requesting additional evidence of \"good faith\" marriage and stating that there is an address discrepancy in their system. I no longer have any proof that we have been living together, because we haven't, since September 2015. When I sent my I-751 last year I was still hoping that we might get back together, because around that time things were improving, until we were back to square one. I am just breaking down at this point, because I simply don't know what to do. USCIS can now claim that I lied on my application, even though its not that simple when two people go through emotional problems and have \"on and off\" relationship. I am also struggling financially and not even sure I can afford a divorce.\n\nWhat should I do? How do I approach this? Is there a way to explain something like this without having to go through a separation process, or divorce proceedings? Any help, or advice would be greatly appreciated. Thank you so very much.   ","spoiler":false,"stickied":false,"subreddit":"immigration","subreddit_id":"t5_2qvj0","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Adjustment of Status I-751. Completely lost and not sure how to proceed.","url":"https://www.reddit.com/r/immigration/comments/6xav0f/adjustment_of_status_i751_completely_lost_and_not/","whitelist_status":null}
