{"archived":false,"author":"diggydiggywahwahwah","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224211,"distinguished":null,"domain":"self.medicine","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xavmv","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":null,"link_flair_text":null,"locked":false,"media":null,"media_embed":{},"num_comments":69,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/medicine/comments/6xavmv/pgy1_barely_holding_it_together/","pinned":false,"retrieved_on":1507285938,"score":72,"secure_media":null,"secure_media_embed":{},"selftext":"Not a throwaway because I just don't care anymore.\n\nBeen an intern since July in a subsurgical program I absolutely love, in a city I want to be in, and surrounded by close co-residents who are great. However, I feel like I'm keeping myself together by a thread.\n\nLittle about me: Had a \"break\" halfway through MS3 with sudden onset anxiety, derealization, and depersonalization. Could have been a combination of poor sleep, stress, etc. Strong sensations of derealization and depersonalization declined some over the following week. Since then I have been an absolute mess *outside of the hospital.* I mean this because I continued to achieve high marks for the duration of medication school, but inside, I felt miserable. Extreme fatigue regardless of my sleep schedule (i could sleep for days), cognitive dysfunction, short term memory loss, sometimes feeling like my body is made of lead. Trialed on multiple antidepressants without relief.\n\nBanked on using the second half of 4th year to iron things out, sleep as much as i wanted, exercise more, etc. Didn't help.\n\nNow, here I am in my third month of residency and I am absolutely miserable with the symptoms I previously described, but are worse. I work, come home, and sleep (i work out 3-4x per week), even on my incredibly light rotations. I'm not retaining information when I read, and I'm getting what feels like anxiety very easily. \n\nI need help. I *want* help. I cant get a psych appointment for over a month, even with utilizing wellness resources at the hospital. Nobody in my program knows, and I feel like I should talk to a faculty like an APD/PD, but I really dont know what good that will do for me. We're in the surgical field. Time off (like a few days) for any one person translates to double the work for everyone else. So why shine that light on me for the program to know?\n\nI'm at a loss while in this holding pattern for my psych appointment but I really dont know how much longer I can handle feeling like this.\n\nAny insight, recommendations, personal anecdotes would be accepted with open arms.\n\nThanks.","spoiler":false,"stickied":false,"subreddit":"medicine","subreddit_id":"t5_2qhff","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"PGY1, barely holding it together.","url":"https://www.reddit.com/r/medicine/comments/6xavmv/pgy1_barely_holding_it_together/","whitelist_status":"all_ads"}
