{"archived":false,"author":"drake022","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224056,"distinguished":null,"domain":"self.HermitCraft","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav56","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"hermitwars","link_flair_text":"HermitQuest","locked":false,"media":null,"media_embed":{},"num_comments":14,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/HermitCraft/comments/6xav56/hermitquest_season_2_ideas/","pinned":false,"retrieved_on":1507285927,"score":12,"secure_media":null,"secure_media_embed":{},"selftext":"So now that the season is officially over, I thought I'd give some suggestions that have been on my mind throughout :D\n\nI remember them saying that this was supposed to be focused more so on questing than PVP, which didn't really seem to case for a lot of teams. I also hated them hiding in at night. So I have a perfect idea: have the gentlemen's rule in effect at night and PVP during the day. That way they have an incentive to go out at night. They have to pick between fighting mobs or players.\n\nI think there should also be a minimum amount of quests needed to be completed before entrance to the arena rather than four hours, or a bonus. For example, if they complete X amount of quests, they receive an extra heart in the arena. \n\nA lot of them had trouble finding certain things on the map like sentinels and the underground entrances. The map should be a bit more detailed or at least indicate the general vicinity for things like those.\n\nSo yeah these are some thoughts I had to help out next season. Hopefully they're helpful. And I loved the season. Shoutout to Black Team for winning and RIP Yellow Team. Yall were winners in my heart.\n","spoiler":false,"stickied":false,"subreddit":"HermitCraft","subreddit_id":"t5_2twma","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"HermitQuest Season 2 Ideas!","url":"https://www.reddit.com/r/HermitCraft/comments/6xav56/hermitquest_season_2_ideas/","whitelist_status":"all_ads"}
