{"archived":false,"author":"ericaalee","author_flair_css_class":null,"author_flair_text":null,"brand_safe":true,"contest_mode":false,"created_utc":1504224082,"distinguished":null,"domain":"self.raisedbynarcissists","edited":false,"gilded":0,"hidden":false,"hide_score":false,"id":"6xav84","is_crosspostable":false,"is_reddit_media_domain":false,"is_self":true,"is_video":false,"link_flair_css_class":"supporturgent","link_flair_text":"[Rant/Vent]","locked":false,"media":null,"media_embed":{},"num_comments":3,"num_crossposts":0,"over_18":false,"parent_whitelist_status":"all_ads","permalink":"/r/raisedbynarcissists/comments/6xav84/remembered_something_today/","pinned":false,"retrieved_on":1507285929,"score":3,"secure_media":null,"secure_media_embed":{},"selftext":"This was back from when I turned 18 years old and it still had not clicked for me that my mom was a nmom. I suppose this might happen more often now that I am learning how unhealthy my childhood was.\n\nAnyhow, so I turn 18 and I have a birthday party. My mom thought it would be a great idea to make a slideshow of pictures of me growing up, which I actually looked forward to. When I first watched it I was with my mom and boyfriend and I could tell she was excited. So it starts playing and basically it starts off with a country song. She knows I hate country, but whatever. I try to brush it off. Then I started hearing the lyrics and I felt so uncomfortable. \n\nThe song was In My Daughter's Eyes by Martina McBride and if you look up the lyrics it is the perfect song for a nmom. Part of it goes \"In my daughter's eyes I am a hero\" and also another line goes \"She was sent to rescue me\". So this video I was looking forward to was never really for me but for her. It was so awkward seeing (bad) photos of me go by with a song like that playing. And I had to put on the fakest smile when it was over otherwise I knew she'd have a fit. Thankfully my boyfriend didn't bother to lie. You could tell by his face he hated it haha. \n\nBut then when more people came to the party my mom had to play it for them but I didn't bother to sit through it again. It really made me feel sick.","spoiler":false,"stickied":false,"subreddit":"raisedbynarcissists","subreddit_id":"t5_2we9n","suggested_sort":null,"thumbnail":"self","thumbnail_height":null,"thumbnail_width":null,"title":"Remembered something today...","url":"https://www.reddit.com/r/raisedbynarcissists/comments/6xav84/remembered_something_today/","whitelist_status":"all_ads"}
